<?php
namespace Database\Seeders;

use App\Models\Article;
use App\Models\Product;
use Illuminate\Database\Seeder;

class ArticlesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Article::query()->delete();
        // دریافت تمامی محصولات
        $products = Product::all();
        $specification ='
            <span class="tw-text-slate-700 tw-text-lg tw-font-semibold">مشخصات کلی</span>
            <div class="row">
                <div class="col-12">
                    <!-- START:DESCRIPTION -->
                    <div class="tw-mt-3">
                        <span class="fs-6 fw-bold">توضیحات</span>
                        <p class="fs-7"> لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.</p>
                    </div>
                    <!-- END: DESCRIPTION -->

                    <!-- START: FEATURES -->
                    <div class="box mt-3">
                        <span class="fs-7 fw-bold">ویژگی ها</span>
                        <ul class="tab-pane-list">
                            <li>ویژگی 1</li>
                            <li>ویژگی 2</li>
                            <li>ویژگی 3</li>
                            <li>ویژگی 4</li>
                            <li>ویژگی 5</li>
                        </ul>
                    </div>
                    <!-- END: FEATURES -->

                    <!-- START: FEATURES -->
                    <div class="box mt-3">
                        <span class="fs-7 fw-bold">انتخاب ها</span>
                        <ul class="tab-pane-list">
                            <li>انتخاب 1</li>
                            <li>انتخاب 2</li>
                            <li>انتخاب 3</li>
                            <li>انتخاب 4</li>
                            <li>انتخاب 5</li>
                        </ul>
                    </div>
                    <!-- END: FEATURES -->
                </div>
            </div>
        ';
        $description='
            <p>
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            </p>
            <figure>
                <img src="/images/auth2.jpg" alt="Trulli">
                <figcaption>Fig.1 - Trulli, Puglia, Italy.</figcaption>
            </figure>
            <p>
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            </p>
        ';
        $guide='
        <div>
            این یک قسمت برای توضیحات نصب و اندازه گیری می باشد که توسط ادمین قابل ویرایش است
        </div>
        ';



        // بررسی وجود حداقل یک محصول
        if ($products->count() > 0) {
            // برای هر محصول، یک ردیف داده به جدول articles اضافه کنید
            foreach ($products as $product) {
                Article::create([
                    'specification' => $specification,
                    'description' => $description,
                    'guide' => $guide,
                    'video' => '/video/1.play',
                    'product_id' => $product->id,
                ]);
            }
        }

    }
}
